<script setup lang="ts"></script>

<template lang="pug">
div
	h4 Guide
	.panel
		q-icon(name="mdi-book-open-page-variant-outline" size="xl" color="primary")
		div
			p Главная задача интерфейса - помощь пользователю.
			p Поэтому важно выстроить <b>иерархию</b> элементов, чтобы отделить главное от второстепенного. Это достигается цветом, размером, положением на экране, отступами и анимацией.
			p В настоящий момент наблюдается разнобой в оформлении:
			ul
				li фона элементов
				li кнопок
				li различных списков

			p Данный гид поможет правильно выбрать цветовые переменные для этих элементов интерфейса.

</template>

<style scoped lang="scss"></style>
